In [1]:
import pandas as pd

In [9]:
dict1 = {"Employee": ['lisa', 'bob', 'jake', 'sue', 'john', 'daisy'],
      "Joining_date":[2011,2012,2013,2014,2015,2016]}

In [5]:
dict1

{'Employee': ['lisa', 'bob', 'jake', 'sue', 'john', 'daisy'],
 'Joining_date': [2011, 2012, 2013, 2014, 2015, 2016]}

In [6]:
df1 = pd.DataFrame(dict1)

In [7]:
df1

  Employee  Joining_date
0     lisa          2011
1      bob          2012
2     jake          2013
3      sue          2014
4     john          2015
5    daisy          2016

In [19]:
dict2 = {"Employee":['bob','jake','lisa','sue','john','daisy'],
        "Department":['Accounting','Engineering','Engineering','HR','Engineering','Engineering']}

In [20]:
df2 = pd.DataFrame(dict2)

In [21]:
df2

  Employee   Department
0      bob   Accounting
1     jake  Engineering
2     lisa  Engineering
3      sue           HR
4     john  Engineering
5    daisy  Engineering

In [23]:
mrgd_data=pd.merge(df1,df2,on="Employee",how="inner")

In [24]:
mrgd_data

  Employee  Joining_date   Department
0     lisa          2011  Engineering
1      bob          2012   Accounting
2     jake          2013  Engineering
3      sue          2014           HR
4     john          2015  Engineering
5    daisy          2016  Engineering

In [30]:
engg = mrgd_data[mrgd_data['Department']=='Engineering']

In [31]:
engg

  Employee  Joining_date   Department
0     lisa          2011  Engineering
2     jake          2013  Engineering
4     john          2015  Engineering
5    daisy          2016  Engineering